temporary/app/controllers/flats_controller.rb

SELECT "categories".* FROM "categories"
SELECT "flats".* FROM "flats"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "WG"]]
SELECT "flats".* FROM "flats" WHERE "flats"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]
---
  def index
    if params[:category].blank?
  	 @flats = Flat.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @flats = Flat.where(:category_id => @category_id).order("created_at DESC")

SELECT "categories".* FROM "categories"
---
  def new
  	@flat = current_user.flats.build
    @categories = Category.all.map{ |c| [c.name, c.id]}

INSERT INTO "flats" ("title", "plz", "town", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "WG in Grenchen"], ["plz", 2540], ["town", "Grenchen"], ["user_id", 1], ["category_id", 1], ["created_at", "2016-05-31 21:08:41.111448"], ["updated_at", "2016-05-31 21:08:41.111448"]]
---
  def create
  	@flat = current_user.flats.build(flat_params)
    @flat.category_id = params[:category_id]

  	if @flat.save

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all.map{ |c| [c.name, c.id]}

UPDATE "flats" SET "flat_image_file_name" = ?, "flat_image_file_size" = ?, "flat_image_updated_at" = ?, "updated_at" = ? WHERE "flats"."id" = ?  [["flat_image_file_name", "hundekorb.jpeg"], ["flat_image_file_size", 8547], ["flat_image_updated_at", "2016-06-13 19:04:18.100641"], ["updated_at", "2016-06-13 19:04:18.258379"], ["id", 3]]
---
  def update
    @flat.category_id = params[:category_id]
  	if @flat.update(flat_params)

DELETE FROM "flats" WHERE "flats"."id" = ?  [["id", 1]]
---
  def destroy
  	@flat.destroy

SELECT  "flats".* FROM "flats" WHERE "flats"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_flat
  	@flat = Flat.find(params[:id])